config/cf/Catalogs/УдалитьУчетныеЗаписиЭлектроннойПочтыДляСозданияЗаданийИзПисем.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Catalog>
		<Properties>
			<Name>УдалитьУчетныеЗаписиЭлектроннойПочтыДляСозданияЗаданийИзПисем</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВлияниеПоУмолчанию</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Влияние</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсполнительПоУмолчанию</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ИсполнительЗадания</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Использовать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодОбработкиСозданногоЗадания</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОрганизацияПоУмолчанию</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Организация</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПриоритетОпределенияКлиентовИИнициаторов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПриоритетПоУмолчанию</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПриоритетЗадания</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцессПоУмолчанию</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Процессы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СервисПоУмолчанию</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сервисы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрочностьПоУмолчанию</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Срочность</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПроцесса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыПроцессов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьТипДокумента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УдалитьТипыДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УслугаПоУмолчанию</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчетнаяЗапись</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчетныеЗаписиЭлектроннойПочты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ИгнорируемыеИнициаторы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Инициатор</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ИнициаторЗадания</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПапкиЭлектронныхПисем</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПапкаЭлектронныхПисем</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПапкиЭлектронныхПисем</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

config/cf/Catalogs/УдалитьУчетныеЗаписиЭлектроннойПочтыДляСозданияЗаданийИзПисем/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;	
	
	ОбновитьПриоритетыОпределения();
	ОбновитьВидимостьИДоступность();
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Объект.ПриоритетОпределенияКлиентовИИнициаторов = "";
	Для Индекс = 1 По ПриоритетОпределения.Количество() Цикл
		Стр = ПриоритетОпределения.Получить(Индекс - 1);
		Объект.ПриоритетОпределенияКлиентовИИнициаторов = Объект.ПриоритетОпределенияКлиентовИИнициаторов 
			+ Стр.Значение + Символы.ПС;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПапкиЭлектронныхПисем

&НаКлиенте
Процедура ПапкиЭлектронныхПисемПослеУдаления(Элемент)
	
	ОбновитьВидимостьИДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура ПапкиЭлектронныхПисемПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	ОбновитьВидимостьИДоступность();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПриоритеты

&НаКлиенте
Процедура ПриоритетЗагрузкиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриоритетЗагрузкиПередУдалением(Элемент, Отказ)
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриоритетЗагрузкиПередНачаломИзменения(Элемент, Отказ)
	
	Отказ = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыИгнорируемыеИнициаторы

&НаКлиенте
Процедура ИгнорируемыеИнициаторы1ПослеУдаления(Элемент)
	
	ОбновитьВидимостьИДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура ИгнорируемыеИнициаторы1ПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	ОбновитьВидимостьИДоступность();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементов

&НаКлиенте
Процедура СрочностьПоУмолчаниюПриИзменении(Элемент)
	
	ОбновитьСрочностьВлияние();
	
КонецПроцедуры

&НаКлиенте
Процедура ВлияниеПоУмолчаниюПриИзменении(Элемент)
	
	ОбновитьСрочностьВлияние();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьВидимостьИДоступность()
	
	Элементы.ГруппаПапкиЭлектронныхПисем.Заголовок = НСтр("ru = 'Фильтр электронных писем'");
	Если Объект.ПапкиЭлектронныхПисем.Количество() > 0 Тогда
		Элементы.ГруппаПапкиЭлектронныхПисем.Заголовок = Элементы.ГруппаПапкиЭлектронныхПисем.Заголовок
			+ СтрШаблон(НСтр("ru = ' (%1)'"), Объект.ПапкиЭлектронныхПисем.Количество());
	КонецЕсли;
		
	Элементы.ИгнорируемыеИнициаторы.Заголовок = НСтр("ru = 'Игнорируемые инициаторы'");
	Если Объект.ИгнорируемыеИнициаторы.Количество() > 0 Тогда
		Элементы.ИгнорируемыеИнициаторы.Заголовок = Элементы.ИгнорируемыеИнициаторы.Заголовок
			+ СтрШаблон(НСтр("ru = ' (%1)'"), Объект.ИгнорируемыеИнициаторы.Количество());
	КонецЕсли;		
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСрочностьВлияние()
	
	Объект.ПриоритетПоУмолчанию = ЗаданияСервер.РассчитатьПриоритет(Объект.ВлияниеПоУмолчанию, Объект.СрочностьПоУмолчанию);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьПриоритетыОпределения()
	
	СЗ = ЗаданияСервер.СписокПриоритетовОпределенияКлиентовИИнициаторов(Объект.Ссылка);
	ПриоритетОпределения.Очистить();
	Для Индекс = 0 По СЗ.Количество() - 1 Цикл
		ПриоритетОпределения.Добавить(СЗ[Индекс].Значение, СЗ[Индекс].Представление);
	КонецЦикла;

КонецПроцедуры

#КонецОбласти
